{
  "_name_or_path": "/apps/sharedstorage/oceanstor-a800/sft/deepspeed_chat_moe/Pretrained_model/final_with_router/",
  "activation": "silu",
  "architectures": [
    "JiutianForCausalLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_jiutian.JiutianConfig",
    "AutoModelForCausalLM": "modeling_jiutian.JiutianForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 0,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.02,
  "intermediate_size": 13824,
  "max_position_embeddings": 4096,
  "model_type": "jiutian",
  "num_attention_heads": 40,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 40,
  "num_key_value_heads": 40,
  "num_local_experts": 8,
  "output_router_logits": true,
  "rms_norm_eps": 1e-08,
  "rope_theta": 10000.0,
  "router_aux_loss_coef": 0.01,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.36.2",
  "use_cache": true,
  "use_cope": false,
  "vocab_size": 69120
}
